# Sony NEWS NWS-5000X

<images>

The NWS-5000X is a MIPS R4400-based workstation released in June 1994. It is
an AP-Bus based system (meaning that it uses AP-Bus expansion cards). Mine came
with an AP-Bus video card included, the DSC-39, which has an analog video output
with a 13W3 connector. The 5000X has four additional AP-Bus slots.

## Booting an NWS-5000X
The 5000X's boot parameters are controlled via DIP switches on the front of the
unit and parameters set in the battery-backed parameter RAM. See
[5000X DIP settings](http://ozuma.o.oo7.jp/unix/news/dip.htm) for a full list.
- DIP Switch 1
  - OFF = Use serial port 0 as the console (9600-8-N-1)
  - ON = Use the xa/xb interface (13W3 monitor) and keyboard as a VT-100 emulator
- DIP Switch 4
  - OFF = Normal operation
  - ON = Force parameter RAM clear on next boot
- DIP Switch 5
  - OFF = Boot into ROM monitor
  - ON = Auto-boot into operating system. If the security lockout is set to 1, this is considered ON regardless of the switch position.

## Using the NWS-5000X ROM monitor
ozuma has a fantastic guide to most of the [ROM monitor commands](http://ozuma.o.oo7.jp/unix/news/command.htm).

### bo - Boot system
The `bo` command tells the ROM monitor to boot the system with the specified SCSI
address and partition. Running `bo` alone is equivalent to running `bo scsi(0,0,0)`.

SCSI devices are specified as `scsi(bus, ID * 10[,partition])`, so, for example,
booting from the internal CD-ROM drive would be done by running `bo scsi(0,60)`.
The 5000X has two SCSI buses. All internal devices are on bus 0, but external
devices can be attached to either bus.

Finally, `bo` supports the `-s` and `-a` flags. `-s` will boot into single-user
mode. `-a` will cause the ROM monitor to prompt the user for the kernel path. The
default path is set by the bootloader, and is usually `/vmunix` for NEWS-OS 4.x,
and `/stand/unix` for 5.x and later.

```
> bo scsi(0,0)
APbus Primary Boot Program
APbus Full Boot Program (0x83e00000-0x83e85d4f)
uts: scsi(0,0)/stand/unix
```

### dl - Display disk label
`dl` will display the BSD disklabel for the specified SCSI address.
```
> dl scsi(0,0)
6 partitions:
#        size   offset     fstype [fsize bsize   cpg]
  0:    79420        0 unassigned   1024  1024    16
  1:   262144    79420       swap    512   512     0
  2:  4178874        0 unassigned    512   512     0
  3:   361587   341564 unassigned   1024  1024    16
  4:  3443955   703151 unassigned   1024  1024    16
  5:    31768  4147106 unassigned   1024  1024    16
> dl scsi(0,40)
8 partitions:
#        size   offset     fstype [fsize bsize   cpg]
  0:    15884        0 unassigned   1024  1024     0
  1:    66880    15884       boot    512   512     0
  2: 17755614        0 unassigned    512   512     0
  3:    15884   374110        var   1024  1024    16
  4:   307200   389994        var    512   512     5
  5: 17058420   697194        var   1024  1024    16
  6: 17381504   374110 unassigned    512   512     0
  7:   291346    82764        var   1024  1024    16
```

### he - ROM Monitor Help
`he` prints the built-in command listing with brief usage descriptions.

### off - Power off the system
Does what it says on the tin.

### ra - Get IP address via RARP
This will cause the NWS-5000X to broadcast its MAC address using RARP to get
an IP address. Requires a RARP server on the network to respond.
```
> ra
192.168.2.75
```

### set - Set or change a variable in parameter RAM
The NWS-5000X has [parameters](http://ozuma.o.oo7.jp/unix/news/rom.htm) that can
be set in battery-backed RAM, including the input device, output device, default
boot disk (used by DIP Switch 5/Security Lockout 1).
Running `set` alone will display the current values. The syntax for changing
variables is `set <variable_name>=<value>`, or simply `set <variable_name>`

```
> set
network=ethernet
bootdev=scsi(0,0)
machine=news5000
cputype=r4000
model=NWS-5000
mon=2
```
